---
kind: method
id: M:Autodesk.Revit.Creation.Application.NewFaceArray
source: html/711bd34a-0df8-4050-0403-2a3eae293641.htm
---
# Autodesk.Revit.Creation.Application.NewFaceArray Method

Creates a new instance of a face array.

## Syntax (C#)
```csharp
public FaceArray NewFaceArray()
```